[
    {
        "question": "I have fatigue, weight gain, cold hands and feet, mood swings, lethargy, dizziness, puffy face and eyes, enlarged thyroid, brittle nails, swollen extremities, depression, irritability, abnormal menstruation, memory problems, hair thinning, dry skin, constipation, muscle weakness, joint pain, hoarseness, slow heart rate, sensitivity to cold, slow metabolism, heavy periods, swelling in joints, thinning eyebrows, trouble concentrating, brittle hair, could this be hypothyroidism?",
        "tags": [
            "hypothyroidism"
        ]
        
    },
    {
        "question": "I have frequent urination, excessive thirst, unexplained weight loss, fatigue, blurred vision, slow healing wounds, numbness in extremities, increased hunger, dry mouth, yeast infections, irritability, tingling feet, skin infections, extreme tiredness, sugar cravings, headaches, dizziness, dehydration, muscle cramps, sweating, slow wound healing, nausea, vomiting, frequent infections, dark patches on skin, fruity-smelling breath, could this be diabetes?",
        "tags": [
            "diabetes"
        ]
    },
    {
        "question": "I have fever, cough, sore throat, runny nose, muscle aches, chills, fatigue, headache, nasal congestion, sneezing, chest discomfort, watery eyes, swollen lymph nodes, ear pain, mild wheezing, shortness of breath, body aches, loss of appetite, sore muscles, shivering, excessive sweating, dizziness, nausea, vomiting, diarrhea, rapid heart rate, could this be flu?",
        "tags": [
            "flu"
        ]
        
    },
    {
        "question": "I experience high blood pressure, headache, dizziness, chest pain, shortness of breath, blurred vision, nosebleeds, fatigue, nausea, confusion, ringing in ears, irregular heartbeat, sweating, difficulty sleeping, swollen ankles, anxiety, pounding in chest, weakness, difficulty concentrating, facial flushing, vision changes, trouble breathing, pain in back, lightheadedness, could this be hypertension?",
        "tags": [
            "hypertension"
        ]
    },
    {
        "question": "I have chest pain, shortness of breath, dizziness, nausea, fatigue, cold sweats, pain in arms or jaw, irregular heartbeat, anxiety, lightheadedness, fainting, indigestion, back pain, vomiting, extreme tiredness, clammy skin, palpitations, feeling weak, sudden sweating, feeling of doom, stomach discomfort, difficulty breathing, could this be heart attack?",
        "tags": [
            "heart attack"
        ]
    },
    {
        "question": "I have persistent cough, chest tightness, wheezing, shortness of breath, difficulty breathing at night, frequent respiratory infections, dry cough, anxiety, blue lips or fingers, difficulty exhaling, fatigue, throat irritation, nasal congestion, sore throat, headaches, increased mucus production, coughing up phlegm, nasal drip, sensitivity to smoke, trouble sleeping, could this be asthma?",
        "tags": [
            "asthma"
        ]
    },
    {
        "question": "I have joint pain, stiffness, swelling, fatigue, redness around joints, decreased range of motion, morning stiffness, difficulty gripping, joint deformities, joint tenderness, cracking sounds, muscle weakness, warmth in joints, back pain, foot pain, knee swelling, difficulty walking, stiffness after sitting, could this be arthritis?",
        "tags": [
            "arthritis"
        ]
    },
    {
        "question": "I have stomach pain, bloating, nausea, vomiting, diarrhea, heartburn, loss of appetite, unexplained weight loss, fatigue, stomach cramps, black stools, bad breath, belching, acid reflux, discomfort after eating, fullness in stomach, burning sensation in stomach, chest discomfort, nausea after eating, could this be gastritis?",
        "tags": [
            "gastritis"
        ]
    },
    {
        "question": "I have skin redness, itching, dry skin, peeling, inflammation, burning sensation, cracked skin, rash, blisters, skin thickening, flaky skin, small bumps, sensitivity to soaps, scaly patches, pain in affected areas, fluid-filled bumps, skin irritation, infection risk, worsened with scratching, could this be eczema?",
        "tags": [
            "eczema"
        ]
    },
    {
        "question": "I have severe headaches, nausea, sensitivity to light, visual disturbances, dizziness, neck stiffness, vomiting, lightheadedness, throbbing pain on one side, irritability, fatigue, difficulty concentrating, blurred vision, tingling in face, speech difficulties, difficulty focusing, aura before headaches, confusion, sweating, could this be migraine?",
        "tags": [
            "migraine"
        ]
    },
    {
        "question": "I have excessive sweating, rapid heartbeat, nervousness, weight loss, increased appetite, heat intolerance, frequent bowel movements, irritability, tremors, difficulty sleeping, fatigue, muscle weakness, brittle hair, excessive thirst, hair thinning, frequent mood swings, anxiety, light sensitivity, could this be hyperthyroidism?",
        "tags": [
            "hyperthyroidism"
        ]
    },
    {
        "question": "I have swelling in the legs, fatigue, difficulty breathing, rapid heartbeat, chest pain, dizziness, frequent urination at night, bloating, weight gain, nausea, irregular heartbeat, fainting, confusion, persistent coughing, swollen abdomen, lack of appetite, shortness of breath while lying down, could this be heart failure?",
        "tags": [
            "heart failure"
        ]
    },
    {
        "question": "I feel sad all the time, experience loss of interest in activities, fatigue, difficulty concentrating, sleep disturbances, appetite changes, feelings of worthlessness, hopelessness, suicidal thoughts, irritability, headaches, back pain, difficulty making decisions, low energy, social withdrawal, crying spells, weight fluctuations, restlessness, agitation, muscle pain, excessive guilt, anxiety, trouble sleeping, sluggishness, unexplained physical pain, slow movements, digestive problems, self-harm tendencies, could this be depression?",
        "tags": [
            "depression"
        ]
    },
    {
        "question": "I have memory loss, confusion, difficulty completing familiar tasks, trouble speaking, disorientation, difficulty recognizing faces, loss of problem-solving skills, mood swings, trouble understanding visual images, personality changes, difficulty following conversations, impaired judgment, trouble handling money, repetitive behaviors, agitation, paranoia, trouble swallowing, loss of motivation, depression, withdrawal from social activities, weight loss, insomnia, delusions, trouble walking, irritability, anxiety, could this be Alzheimer's disease?",
        "tags": [
            "Alzheimer's disease"
        ]
    },
    {
        "question": "I experience chronic muscle pain, fatigue, memory issues, sleep disturbances, joint stiffness, numbness in extremities, headaches, depression, anxiety, trouble focusing, digestive issues, dizziness, nausea, restless legs, heightened sensitivity to pain, bladder problems, excessive sweating, mood swings, temperature sensitivity, tingling in arms, difficulty swallowing, migraines, difficulty exercising, morning stiffness, could this be fibromyalgia?",
        "tags": [
            "fibromyalgia"
        ]
    },
    {
        "question": "I have persistent diarrhea, abdominal pain, bloating, weight loss, fatigue, nausea, vomiting, loss of appetite, acid reflux, joint pain, skin rashes, muscle cramps, brittle nails, depression, mouth ulcers, irritability, tingling in hands and feet, constipation, anemia, vitamin deficiencies, foggy brain, bone loss, could this be celiac disease?",
        "tags": [
            "celiac disease"
        ]},
    {
        "question": "I have excessive worry, restlessness, difficulty concentrating, muscle tension, fatigue, rapid heartbeat, shortness of breath, nausea, dizziness, difficulty falling asleep, trembling, excessive sweating, stomach aches, irritability, panic attacks, lightheadedness, heart palpitations, fear of losing control, tight chest, dry mouth, nausea, tension headaches, trouble relaxing, fear of social interactions, could this be generalized anxiety disorder?",
        "tags": [
            "generalized anxiety disorder"
        ]
    },
    {
        "question": "I have sudden chest pain, difficulty breathing, cold sweats, rapid heartbeat, dizziness, feeling of choking, numbness in hands, trembling, intense fear, nausea, lightheadedness, blurred vision, muscle tightness, excessive sweating, depersonalization, hot flashes, chest tightness, tingling in extremities, overwhelming dread, difficulty swallowing, could this be a panic attack?",
        "tags": [
            "panic attack"
        ]
    },
    {
        "question": "I have excessive daytime sleepiness, loud snoring, pauses in breathing while sleeping, waking up gasping for air, morning headaches, difficulty concentrating, irritability, memory problems, dry mouth in the morning, difficulty staying asleep, fatigue, depression, mood swings, anxiety, trouble focusing, high blood pressure, weight gain, excessive night sweating, could this be sleep apnea?",
        "tags": [
            "sleep apnea"
        ]
    },
    {
        "question": "I have severe abdominal pain, bloody diarrhea, unintentional weight loss, frequent urgent bowel movements, chronic fatigue, fever, joint pain, rectal bleeding, nausea, vomiting, skin rashes, eye irritation, bloating, stomach cramps, painful bowel movements, reduced appetite, could this be Crohn's disease?",
        "tags": [
            "Crohn's disease"
        ]
    },
    {
        "question": "I have muscle rigidity, tremors, slow movement, difficulty walking, poor posture, loss of facial expressions, speech problems, depression, memory loss, hallucinations, difficulty swallowing, balance problems, sleep disturbances, slurred speech, drooling, could this be Parkinson's disease?",
        "tags": [
            "Parkinson's disease"
        ]
    },
    {
        "question": "I have persistent bloating, abdominal discomfort, changes in bowel habits, feeling full quickly, loss of appetite, unintentional weight loss, fatigue, frequent urination, back pain, nausea, indigestion, could this be ovarian cancer?",
        "tags": [
            "ovarian cancer"
        ]
    },
    {
        "question": "I have fever, dry cough, fatigue, loss of taste and smell, shortness of breath, headache, chills, muscle aches, sore throat, nasal congestion, nausea, vomiting, diarrhea, pink eye, chest pain, brain fog, dizziness, joint pain, night sweats, body aches, skin rashes, confusion, heart palpitations, could this be COVID-19?",
        "tags": [
            "COVID-19"
        ]
    },
    {
        "question": "I have fever, runny nose, sore throat, cough, sneezing, chills, body aches, mild headache, fatigue, watery eyes, nasal congestion, ear pain, swollen lymph nodes, post-nasal drip, could this be the common cold?",
        "tags": [
            "common cold"
        ]
    },
    {
        "question": "I have bloating, diarrhea, abdominal cramps, nausea, vomiting, stomach pain, fever, fatigue, headache, excessive gas, chills, muscle aches, dehydration, could this be food poisoning?",
        "tags": [
            "food poisoning"
        ]
    },
    {
        "question": "I have heartburn, chest pain, regurgitation of food, difficulty swallowing, chronic cough, sore throat, hoarseness, nausea, vomiting, bad breath, excessive burping, could this be GERD?",
        "tags": [
            "GERD"
        ]
    },
    {
        "question": "I have memory problems, trouble concentrating, confusion, excessive sleepiness, dizziness, vision issues, headaches, muscle weakness, numbness, speech difficulties, could this be multiple sclerosis?",
        "tags": [
            "multiple sclerosis"
        ]
    },
    {
        "question": "I have an irregular heartbeat, chest pain, dizziness, shortness of breath, excessive sweating, fatigue, palpitations, fainting, could this be a heart arrhythmia?",
        "tags": [
            "heart arrhythmia"
        ]
    },
    {
        "question": "I have bloating, constipation, diarrhea, stomach cramps, mucus in stool, nausea, loss of appetite, could this be irritable bowel syndrome (IBS)?",
        "tags": [
            "IBS"
        ]
    },
    {
        "question": "I have persistent coughing, wheezing, difficulty breathing, weight loss, night sweats, fatigue, chest pain, frequent respiratory infections, could this be chronic obstructive pulmonary disease (COPD)?",
        "tags": [
            "COPD"
        ]
    }
]
